Tutorials/pcmAirSeparated/0.orig/air/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    airLeft
    {
        type            noSlip;
    }
   
    airTop
    {
        type            noSlip;
    }
   
    airBottom
    {
        type            noSlip;
    }
    
    air_to_pcm    
    {
        type            noSlip;
    }
    
    frontAndBack
    { 
        type            empty;
    }
}

// ************************************************************************* //
