Tutorials/pcmAirSeparated/0.orig/pcm/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/pcm";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    pcmRight
    {
        type            noSlip;
    }
   
    pcmTop
    {
        type            noSlip;
    }
   
    pcmBottom
    {
        type            noSlip;
    }
    
    pcm_to_air
    {
        type            noSlip;
    }
}

// ************************************************************************* //
