Tutorials/pcmAirSeparated/system/controlDict.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       STARTFROM;

startTime       0;

stopAt          endTime;

endTime         ENDTIME;

deltaT          DELTAT;

writeControl    adjustableRunTime;

writeInterval  WRITEINTERVAL;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.2;

maxDi           5.0;

adjustTimeStep  no;


// ************************************************************************* //


functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval 2;
        region    pcm;
        probeLocations
        (
            (0.00001 0.01 0)//Fig 11// a
            (0.00001 0.075 0)//Fig 11// b
            (0.00001 0.15 0)//Fig 11// c
            (0.00001 0.28 0)//Fig 11// d
        );
        fixedLocations  false;
        fields
        (
            T
        );
    }
}

